In [4]:
import MySQLdb

In [1]:
import sqlite3
import pandas as pd

In [6]:
db = sqlite3.connect("flights.db")

In [7]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [8]:
query = 'select * FROM sqlite_master;'
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,airports,airports,2,"CREATE TABLE airports (\n[index] INTEGER,\n [..."
1,index,ix_airports_index,airports,3,CREATE INDEX ix_airports_index ON airports ([i...
2,table,airlines,airlines,945,"CREATE TABLE airlines (\n[index] INTEGER,\n [..."
3,index,ix_airlines_index,airlines,946,CREATE INDEX ix_airlines_index ON airlines ([i...
4,table,routes,routes,1393,"CREATE TABLE routes (\n[index] INTEGER,\n [ai..."
5,index,ix_routes_index,routes,1394,CREATE INDEX ix_routes_index ON routes ([index])
6,table,daily_flights,daily_flights,5290,"CREATE TABLE ""daily_flights"" (\n""index"" INTEGE..."
7,index,ix_daily_flights_index,daily_flights,5292,"CREATE INDEX ""ix_daily_flights_index""ON ""daily..."

In [14]:
query = 'select count (*) as count from airports;'
run_query(query)

   count
0   8107

In [20]:
query = 'select * from airports limit 5;'
run_query(query)

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

In [15]:
query = 'select count (*) as count from airlines;'
run_query(query)

   count
0   6051

In [21]:
query = 'select * from airlines limit 5;'
run_query(query)

,index,id,name,alias,iata,icao,callsign,country,active,airplanes
0,0,1,Private flight,\N,-,None,None,None,Y,None
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N,None
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y,None
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N,None
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N,None

In [16]:
query = 'select count (*) as count from routes;'
run_query(query)

   count
0  67663

In [22]:
query = 'select * from routes limit 5;'
run_query(query)

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2

In [30]:
query = 'SHOW COLUMNS FROM routes;'
run_query(query)

DatabaseError: Execution failed on sql 'SHOW COLUMNS FROM routes;': near "SHOW": syntax error

In [17]:
query = 'select count (*) as count from daily_flights;'
run_query(query)

   count
0      3

In [23]:
query = 'select * from daily_flights limit 5;'
run_query(query)

   index  id            departure              arrival number  route_id
0      0   1  2016-09-29 00:00:00  2016-09-29 12:00:00     T1         1
1      1   2      2016-09-28 0:00     2016-09-28 12:00     T1         1
2      1   2      2016-09-28 0:00     2016-09-28 12:00     T1         1